/** Fisher’s Logic Engine - Master Data Export */
const FISHER_DATA = {
  "spots": [
    {
      "id": "アレクサンドリア旧市街",
      "name": "アレクサンドリア旧市街",
      "allFish": [
        "エレクトロベタ",
        "サンダーレッド",
        "ヤースラニボウフィン",
        "ヘリテージグルーパー",
        "ゴールデングルーパー"
      ],
      "conditions": [
        {
          "weather": "霧晴れ12-16",
          "bait": "紅サシ",
          "fishList": [
            {
              "name": "エレクトロベタ",
              "weight": "200",
              "biteTime": 15,
              "type": "小型",
              "isHidden": false
            },
            {
              "name": "サンダーレッド",
              "weight": "200",
              "biteTime": 15,
              "type": "小型",
              "isHidden": false
            },
            {
              "name": "ヤースラニボウフィン",
              "weight": "160",
              "biteTime": 20,
              "type": "大型",
              "isHidden": false
            },
            {
              "name": "ヘリテージグルーパー",
              "weight": "0",
              "biteTime": 0,
              "type": "大型",
              "isHidden": false
            },
            {
              "name": "ゴールデングルーパー",
              "weight": "h",
              "biteTime": 30,
              "type": "大型",
              "isHidden": true
            }
          ],
          "dynamics": {
            "なし": {
              "pDisc": [
                0.24100000000000002,
                0.256,
                0.27399999999999997
              ],
              "pGuar": [
                0.037000000000000005,
                0.098,
                0.124
              ],
              "pDiscGuar": {
                "1-2": 0.098,
                "1-3": 0.124,
                "2-3": 0.124
              },
              "pDiscHit": {
                "1-1": 0.16,
                "1-2": 0.07,
                "1-3": 0.04,
                "2-2": 0.21,
                "2-3": 0.06,
                "3-3": 0.29
              }
            },
            "エレクトロベタ": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0,
                "1-3": 0,
                "2-3": 0
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            },
            "サンダーレッド": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0,
                "1-3": 0,
                "2-3": 0
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            },
            "ヤースラニボウフィン": {
              "pDisc": [
                0.258,
                0.284,
                0.433
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0.098,
                "1-3": 0.124,
                "2-3": 0.124
              },
              "pDiscHit": {
                "1-1": 0.36,
                "1-2": 0.15,
                "1-3": 0.23,
                "2-2": 0.38,
                "2-3": 0.29,
                "3-3": 0.63
              }
            },
            "ヘリテージグルーパー": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0,
                "1-3": 0,
                "2-3": 0
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            },
            "ゴールデングルーパー": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0.037000000000000005,
                0.098,
                0.124
              ],
              "pDiscGuar": {
                "1-2": 0,
                "1-3": 0,
                "2-3": 0
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            }
          }
        },
        {
          "weather": "霧晴れ12-16",
          "bait": "ポッパールアー",
          "fishList": [
            {
              "name": "エレクトロベタ",
              "weight": "160",
              "biteTime": 20,
              "type": "小型",
              "isHidden": false
            },
            {
              "name": "サンダーレッド",
              "weight": "160",
              "biteTime": 20,
              "type": "小型",
              "isHidden": false
            },
            {
              "name": "ヤースラニボウフィン",
              "weight": "160",
              "biteTime": 25,
              "type": "大型",
              "isHidden": false
            },
            {
              "name": "ヘリテージグルーパー",
              "weight": "1",
              "biteTime": 30,
              "type": "大型",
              "isHidden": false
            },
            {
              "name": "ゴールデングルーパー",
              "weight": "h",
              "biteTime": 30,
              "type": "大型",
              "isHidden": true
            }
          ],
          "dynamics": {
            "なし": {
              "pDisc": [
                0.24100000000000002,
                0.256,
                0.27399999999999997
              ],
              "pGuar": [
                0.037000000000000005,
                0.098,
                0.124
              ],
              "pDiscGuar": {
                "1-2": 0.098,
                "1-3": 0.124,
                "2-3": 0.124
              },
              "pDiscHit": {
                "1-1": 0.16,
                "1-2": 0.07,
                "1-3": 0.04,
                "2-2": 0.21,
                "2-3": 0.06,
                "3-3": 0.29
              }
            },
            "エレクトロベタ": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0,
                "1-3": 0,
                "2-3": 0
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            },
            "サンダーレッド": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0,
                "1-3": 0,
                "2-3": 0
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            },
            "ヤースラニボウフィン": {
              "pDisc": [
                0.258,
                0.284,
                0.433
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0.098,
                "1-3": 0.124,
                "2-3": 0.124
              },
              "pDiscHit": {
                "1-1": 0.36,
                "1-2": 0.15,
                "1-3": 0.23,
                "2-2": 0.38,
                "2-3": 0.29,
                "3-3": 0.63
              }
            },
            "ヘリテージグルーパー": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0,
                "1-3": 0,
                "2-3": 0
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            },
            "ゴールデングルーパー": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0.037000000000000005,
                0.098,
                0.124
              ],
              "pDiscGuar": {
                "1-2": 0,
                "1-3": 0,
                "2-3": 0
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            }
          }
        },
        {
          "weather": "霧晴れ12-16",
          "bait": "万能ルアー",
          "fishList": [
            {
              "name": "エレクトロベタ",
              "weight": "300",
              "biteTime": 20,
              "type": "小型",
              "isHidden": false
            },
            {
              "name": "サンダーレッド",
              "weight": "200",
              "biteTime": 20,
              "type": "小型",
              "isHidden": false
            },
            {
              "name": "ヤースラニボウフィン",
              "weight": "160",
              "biteTime": 30,
              "type": "大型",
              "isHidden": false
            },
            {
              "name": "ヘリテージグルーパー",
              "weight": "1",
              "biteTime": 30,
              "type": "大型",
              "isHidden": false
            },
            {
              "name": "ゴールデングルーパー",
              "weight": "h",
              "biteTime": 0,
              "type": "大型",
              "isHidden": true
            }
          ],
          "dynamics": {
            "なし": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0,
                "1-3": 0,
                "2-3": 0
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            },
            "エレクトロベタ": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0,
                "1-3": 0,
                "2-3": 0
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            },
            "サンダーレッド": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0,
                "1-3": 0,
                "2-3": 0
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            },
            "ヤースラニボウフィン": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0,
                "1-3": 0,
                "2-3": 0
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            },
            "ヘリテージグルーパー": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0,
                "1-3": 0,
                "2-3": 0
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            },
            "ゴールデングルーパー": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0,
                "1-3": 0,
                "2-3": 0
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            }
          }
        },
        {
          "weather": "霧晴れ12-16以外",
          "bait": "紅サシ",
          "fishList": [
            {
              "name": "エレクトロベタ",
              "weight": "200",
              "biteTime": 15,
              "type": "小型",
              "isHidden": false
            },
            {
              "name": "サンダーレッド",
              "weight": "200",
              "biteTime": 15,
              "type": "小型",
              "isHidden": false
            },
            {
              "name": "ヤースラニボウフィン",
              "weight": "160",
              "biteTime": 20,
              "type": "大型",
              "isHidden": false
            },
            {
              "name": "ヘリテージグルーパー",
              "weight": "0",
              "biteTime": 0,
              "type": "大型",
              "isHidden": false
            },
            {
              "name": "ゴールデングルーパー",
              "weight": "h",
              "biteTime": 30,
              "type": "大型",
              "isHidden": true
            }
          ],
          "dynamics": {
            "なし": {
              "pDisc": [
                0.24100000000000002,
                0.256,
                0.27399999999999997
              ],
              "pGuar": [
                0.037000000000000005,
                0.098,
                0.124
              ],
              "pDiscGuar": {
                "1-2": 0.098,
                "1-3": 0.124,
                "2-3": 0.124
              },
              "pDiscHit": {
                "1-1": 0.16,
                "1-2": 0.07,
                "1-3": 0.04,
                "2-2": 0.21,
                "2-3": 0.06,
                "3-3": 0.29
              }
            },
            "エレクトロベタ": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0,
                "1-3": 0,
                "2-3": 0
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            },
            "サンダーレッド": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0,
                "1-3": 0,
                "2-3": 0
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            },
            "ヤースラニボウフィン": {
              "pDisc": [
                0.258,
                0.284,
                0.433
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0.098,
                "1-3": 0.124,
                "2-3": 0.124
              },
              "pDiscHit": {
                "1-1": 0.36,
                "1-2": 0.15,
                "1-3": 0.23,
                "2-2": 0.38,
                "2-3": 0.29,
                "3-3": 0.63
              }
            },
            "ヘリテージグルーパー": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0,
                "1-3": 0,
                "2-3": 0
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            },
            "ゴールデングルーパー": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0.037000000000000005,
                0.098,
                0.124
              ],
              "pDiscGuar": {
                "1-2": 0.098,
                "1-3": 0.124,
                "2-3": 0.124
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            }
          }
        },
        {
          "weather": "霧晴れ12-16以外",
          "bait": "ポッパールアー",
          "fishList": [
            {
              "name": "エレクトロベタ",
              "weight": "160",
              "biteTime": 20,
              "type": "小型",
              "isHidden": false
            },
            {
              "name": "サンダーレッド",
              "weight": "160",
              "biteTime": 20,
              "type": "小型",
              "isHidden": false
            },
            {
              "name": "ヤースラニボウフィン",
              "weight": "160",
              "biteTime": 25,
              "type": "大型",
              "isHidden": false
            },
            {
              "name": "ヘリテージグルーパー",
              "weight": "0",
              "biteTime": 30,
              "type": "大型",
              "isHidden": false
            },
            {
              "name": "ゴールデングルーパー",
              "weight": "h",
              "biteTime": 30,
              "type": "大型",
              "isHidden": true
            }
          ],
          "dynamics": {
            "なし": {
              "pDisc": [
                0.24100000000000002,
                0.256,
                0.27399999999999997
              ],
              "pGuar": [
                0.037000000000000005,
                0.098,
                0.124
              ],
              "pDiscGuar": {
                "1-2": 0.098,
                "1-3": 0.124,
                "2-3": 0.124
              },
              "pDiscHit": {
                "1-1": 0.16,
                "1-2": 0.07,
                "1-3": 0.04,
                "2-2": 0.21,
                "2-3": 0.06,
                "3-3": 0.29
              }
            },
            "エレクトロベタ": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0,
                "1-3": 0,
                "2-3": 0
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            },
            "サンダーレッド": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0,
                "1-3": 0,
                "2-3": 0
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            },
            "ヤースラニボウフィン": {
              "pDisc": [
                0.258,
                0.284,
                0.433
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0.098,
                "1-3": 0.124,
                "2-3": 0.124
              },
              "pDiscHit": {
                "1-1": 0.36,
                "1-2": 0.15,
                "1-3": 0.23,
                "2-2": 0.38,
                "2-3": 0.29,
                "3-3": 0.63
              }
            },
            "ヘリテージグルーパー": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0,
                "1-3": 0,
                "2-3": 0
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            },
            "ゴールデングルーパー": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0.037000000000000005,
                0.098,
                0.124
              ],
              "pDiscGuar": {
                "1-2": 0.098,
                "1-3": 0.124,
                "2-3": 0.124
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            }
          }
        },
        {
          "weather": "霧晴れ12-16以外",
          "bait": "万能ルアー",
          "fishList": [
            {
              "name": "エレクトロベタ",
              "weight": "300",
              "biteTime": 20,
              "type": "小型",
              "isHidden": false
            },
            {
              "name": "サンダーレッド",
              "weight": "200",
              "biteTime": 20,
              "type": "小型",
              "isHidden": false
            },
            {
              "name": "ヤースラニボウフィン",
              "weight": "160",
              "biteTime": 30,
              "type": "大型",
              "isHidden": false
            },
            {
              "name": "ヘリテージグルーパー",
              "weight": "0",
              "biteTime": 30,
              "type": "大型",
              "isHidden": false
            },
            {
              "name": "ゴールデングルーパー",
              "weight": "h",
              "biteTime": 0,
              "type": "大型",
              "isHidden": true
            }
          ],
          "dynamics": {
            "なし": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0,
                "1-3": 0,
                "2-3": 0
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            },
            "エレクトロベタ": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0,
                "1-3": 0,
                "2-3": 0
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            },
            "サンダーレッド": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0,
                "1-3": 0,
                "2-3": 0
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            },
            "ヤースラニボウフィン": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0,
                "1-3": 0,
                "2-3": 0
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            },
            "ヘリテージグルーパー": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0,
                "1-3": 0,
                "2-3": 0
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            },
            "ゴールデングルーパー": {
              "pDisc": [
                0,
                0,
                0
              ],
              "pGuar": [
                0,
                0,
                0
              ],
              "pDiscGuar": {
                "1-2": 0,
                "1-3": 0,
                "2-3": 0
              },
              "pDiscHit": {
                "1-1": 0,
                "1-2": 0,
                "1-3": 0,
                "2-2": 0,
                "2-3": 0,
                "3-3": 0
              }
            }
          }
        }
      ]
    }
  ]
};